docs/Emacs.org
#+TITLE: My Emacs Configuration
#+STARTUP: overview
#+PROPERTY: header-args:emacs-lisp :tangle ../.config/emacs/init.el :comments org

This is my [[https://gnu.org/software/emacs/][Emacs]] configuration and documentation.

* Table of Contents
:PROPERTIES:
:TOC:      :include all :depth 3 :ignore (this)
:END:
:CONTENTS:
- [[#from-nothing-to-something--bootstraping][From Nothing To Something  (Bootstraping)]]
  - [[#file-header][File Header]]
  - [[#profiling][Profiling]]
  - [[#cache-directory][Cache Directory]]
  - [[#packages-management][Packages Management]]
    - [[#straightel][straight.el]]
    - [[#use-package][use-package]]
  - [[#keybindings-utilities][Keybindings Utilities]]
    - [[#evil][evil]]
    - [[#evil-collection][evil-collection]]
    - [[#hydra][hydra]]
    - [[#which-key][which-key]]
    - [[#general][general]]
  - [[#window-manager][Window Manager]]
- [[#user-interface][User Interface]]
  - [[#keybindings][Keybindings]]
  - [[#icons][Icons]]
    - [[#all-the-icons][all-the-icons]]
  - [[#minibuffer][Minibuffer]]
    - [[#amx][amx]]
    - [[#counsel][counsel]]
    - [[#ivy-rich][ivy-rich]]
    - [[#ivy-posframe][ivy-posframe]]
  - [[#code-completions][Code Completions]]
    - [[#company][company]]
    - [[#company-dict][company-dict]]
    - [[#company-box][company-box]]
  - [[#fonts][Fonts]]
  - [[#dashboard][Dashboard]]
  - [[#frames][Frames]]
  - [[#modeline][Modeline]]
    - [[#doom-modeline][doom-modeline]]
    - [[#minions][minions]]
  - [[#notifications][Notifications]]
  - [[#help-interface-helpful][Help Interface (helpful)]]
  - [[#theme][Theme]]
- [[#utilities][Utilities]]
  - [[#helm-completions][Helm Completions]]
- [[#editing][Editing]]
  - [[#generic-editing-configurations][Generic Editing Configurations]]
    - [[#folding-hideshow][Folding (hideshow)]]
    - [[#parens--co-smartparens][Parens & Co. (smartparens)]]
    - [[#evil-nerd-commenter][evil-nerd-commenter]]
    - [[#ws-butler][ws-butler]]
    - [[#parinfer][parinfer]]
    - [[#rainbow-delimiters][rainbow-delimiters]]
  - [[#snippets][Snippets]]
    - [[#yasnippet][yasnippet]]
  - [[#code-completions][Code Completions]]
  - [[#git-magit][Git (magit)]]
    - [[#magit][magit]]
    - [[#evil-magit][evil-magit]]
    - [[#git-gutter][git-gutter]]
    - [[#git-link][git-link]]
    - [[#magit-todos][magit-todos]]
  - [[#project-management-projectile][Project Management (projectile)]]
    - [[#projectile][projectile]]
    - [[#counsel-projectile][counsel-projectile]]
  - [[#syntax-checking-flycheck][Syntax Checking (flycheck)]]
- [[#org-applications][Org Applications]]
  - [[#org-mode][Org Mode]]
  - [[#org-enhancements][Org Enhancements]]
    - [[#org-evilification-evil-org][Org Evilification (evil-org)]]
    - [[#better-dots-org-bullets][Better Dots (org-bullets)]]
    - [[#table-of-contents-generator-org-make-toc][Table of Contents Generator (org-make-toc)]]
    - [[#opendocument-exporter-ox-odt][OpenDocument Exporter (ox-odt)]]
  - [[#shared-constants][Shared Constants]]
  - [[#documents-reader-pdf][Documents Reader (PDF)]]
  - [[#emails-reader][Emails Reader]]
  - [[#getting-things-done-agenda][Getting Things Done (Agenda)]]
    - [[#variables--constants][Variables & Constants]]
    - [[#org-agenda][org-agenda]]
    - [[#org-capture][org-capture]]
    - [[#org-refile][org-refile]]
  - [[#taking-smart-notes-slip-box][Taking Smart Notes (Slip Box)]]
    - [[#the-notes-and-glossaries-boxes][The Notes And Glossaries Boxes]]
    - [[#the-annotated-bibliography-box][The Annotated Bibliography Box]]
    - [[#variables--constants][Variables & Constants]]
    - [[#application-functions][Application Functions]]
  - [[#you-need-a-budget-budget][You Need A Budget (Budget)]]
    - [[#ledger-mode][ledger-mode]]
    - [[#flycheck-ledger][flycheck-ledger]]
    - [[#evil-ledger][evil-ledger]]
- [[#languages][Languages]]
  - [[#elisp][Elisp]]
    - [[#cask][cask]]
    - [[#cask-mode][cask-mode]]
    - [[#buttercup][buttercup]]
  - [[#haskell][Haskell]]
    - [[#haskell-mode][haskell-mode]]
    - [[#dante][dante]]
    - [[#attrap][attrap]]
  - [[#json-json-mode][Json (json-mode)]]
  - [[#latex][LaTeX]]
  - [[#yaml][YAML]]
  - [[#xml-nxml][XML (nxml)]]
- [[#appendix][Appendix]]
  - [[#some-snippets][Some Snippets]]
  - [[#on-save][On Save]]
:END:

* From Nothing To Something  (Bootstraping)

We begin here our [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Init-File.html][init file]], the first file that will be loaded to
initialize Emacs.

** File Header

The first thing is, of course, the file header.

#+begin_src emacs-lisp
;;; init.el --- My Emacs Config -*- lexical-binding: t; -*-

;; Author: Jean Gregory Verret <gregory.verret@gmail.com>
;; This program is free software; you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation, either version 3 of the License, or
;; (at your option) any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with this program. If not, see <http://www.gnu.org/licenses/>.

;;; Commentary:

;; This is my Emacs configuration.

;;; Code:
#+end_src

:PROPERTIES:
:Custom_ID: file-header
:END:
** Profiling

Make startup faster by reducing the frequency of garbage collection and then use
a hook to measure Emacs startup time.

#+begin_src emacs-lisp
;; The default is 800k (mesured in bytes).
(setq gc-cons-threshold (* 50 1000 1000))

;; Profile emacs startup.
(add-hook 'emacs-startup-hook
          (lambda ()
            (message "*** Emacs loaded in %s with %d garbage collections."
                     (format "%.2f seconds"
                             (float-time
                              (time-subtract after-init-time before-init-time)))
                     gcs-done)))
#+end_src

** Cache Directory

To keep our config directory clean, we are gonna use another directory
for our cache. I don’t want a bunch of transient files showing up as
untracked in the Git repository.

#+begin_src emacs-lisp
(setq user-emacs-directory "~/.cache/emacs/"
      backup-directory-alist `(("." . ,(expand-file-name "backups"
                                                         user-emacs-directory)))
      url-history-file (expand-file-name "url/history" user-emacs-directory)
      auto-save-list-file-prefix (expand-file-name "auto-save-list/.saves-"
                                                   user-emacs-directory)
      projectile-known-projects-file (expand-file-name
                                      "projectile-bookmarks.eld"
                                      user-emacs-directory))

;; Keep customization settings in a temporary file (thanks Ambrevar!).
(setq custom-file
      (if (boundp 'server-socket-dir)
          (expand-file-name "custom.el" server-socket-dir)
        (expand-file-name (format "emacs-custom-%s.el" (user-uid))
                          temporary-file-directory)))
(load custom-file t)
#+end_src

** Packages Management

And finally, we need to be able to download, install and load
packages. For the download and the installation, [[https://github.com/raxod502/straight.el][straight.el]]
will be used, and for the loading, [[https://github.com/jwiegley/use-package][use-package]] is gonna be the
choosen one.

*** ~straight.el~
:PROPERTIES:
:Custom_ID: packages-installation--straight
:END:

Packages need to be installed first (if not already installed), and loaded
before we can use them.

To install them, [[https://github.com/raxod502/straight.el][straight.el]], the next-generation, purely functional
package manager for the Emacs hacker is used and to load them, [[https://github.com/jwiegley/use-package][use-package]] is
used and integrated to straight.

#+begin_src emacs-lisp
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el"
                         user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
#+end_src

*** ~use-package~

Using straight, we can now download, install and load /use-package/.

#+begin_src emacs-lisp
(straight-use-package 'use-package)
(setq straight-use-package-by-default t)
(setq use-package-verbose t)
#+end_src

** Keybindings Utilities

Keybindings is quite a powerful aspect of Emacs and we will install
some helper utilities to help us with it.

*** ~evil~
:PROPERTIES:
:Custom_ID: user-interface--keybindings--evil
:END:

#+begin_quote
Now you see that evil will always triumph, because good is dumb. -- Dark Helmet
#+end_quote

#+begin_src emacs-lisp
(use-package evil
  :custom
  (evil-want-integration t)
  (evil-want-keybinding nil)
  (evil-want-C-u-scroll t)
  (evil-want-C-i-jump nil)
  (evil-respect-visual-line-mode t)

  :config
  (evil-mode 1))
#+end_src

*** ~evil-collection~
:PROPERTIES:
:Custom_ID: user-interface--keybindings--evil-collection
:END:

#+begin_src emacs-lisp
(use-package evil-collection
  :defer t
  :after evil

  :custom
  (evil-collection-outline-bind-tab-p nil))
#+end_src

*** ~hydra~
:PROPERTIES:
:Custom_ID: user-interface--keybindings--hydra
:END:

#+begin_quote
make Emacs bindings that stick around. -- [[https://github.com/abo-abo/hydra][hydra]]
#+end_quote

#+begin_src emacs-lisp
(use-package hydra
  :defer t)
#+end_src

*** ~which-key~
:PROPERTIES:
:Custom_ID: use-package--which-key
:END:

#+begin_quote
Emacs package that displays available keybindings in popup. -- [[https://github.com/justbur/emacs-which-key][which-key]]
#+end_quote

#+begin_src emacs-lisp
(use-package which-key
  :custom
  (which-key-idle-delay 0.3)

  :config
  (which-key-mode))
#+end_src

*** ~general~
:PROPERTIES:
:Custom_ID: use-package--general
:END:

#+begin_quote
More convenient key definitions in emacs. -- [[https://github.com/noctuid/general.el][general.el]]
#+end_quote

#+begin_src emacs-lisp
(use-package general
  :config
  (general-evil-setup t))
#+end_src

