.config/emacs/init.el
;; File Header

;; The first thing is, of course, the file header.


;;; init.el --- My Emacs Config -*- lexical-binding: t; -*-

;; Author: Jean Gregory Verret <gregory.verret@gmail.com>
;; This program is free software; you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation, either version 3 of the License, or
;; (at your option) any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with this program. If not, see <http://www.gnu.org/licenses/>.

;;; Commentary:

;; This is my Emacs configuration.

;;; Code:

;; Profiling

;; Make startup faster by reducing the frequency of garbage collection and then use
;; a hook to measure Emacs startup time.


;; The default is 800k (mesured in bytes).
(setq gc-cons-threshold (* 50 1000 1000))

;; Profile emacs startup.
(add-hook 'emacs-startup-hook
          (lambda ()
            (message "*** Emacs loaded in %s with %d garbage collections."
                     (format "%.2f seconds"
                             (float-time
                              (time-subtract after-init-time before-init-time)))
                     gcs-done)))

;; Cache Directory

;; To keep our config directory clean, we are gonna use another directory
;; for our cache. I don’t want a bunch of transient files showing up as
;; untracked in the Git repository.


(setq user-emacs-directory "~/.cache/emacs/"
      backup-directory-alist `(("." . ,(expand-file-name "backups"
                                                         user-emacs-directory)))
      url-history-file (expand-file-name "url/history" user-emacs-directory)
      auto-save-list-file-prefix (expand-file-name "auto-save-list/.saves-"
                                                   user-emacs-directory)
      projectile-known-projects-file (expand-file-name
                                      "projectile-bookmarks.eld"
                                      user-emacs-directory))

;; Keep customization settings in a temporary file (thanks Ambrevar!).
(setq custom-file
      (if (boundp 'server-socket-dir)
          (expand-file-name "custom.el" server-socket-dir)
        (expand-file-name (format "emacs-custom-%s.el" (user-uid))
                          temporary-file-directory)))
(load custom-file t)

;; ~straight.el~
;; :PROPERTIES:
;; :Custom_ID: packages-installation--straight
;; :END:

;; Packages need to be installed first (if not already installed), and loaded
;; before we can use them.

;; To install them, [[https://github.com/raxod502/straight.el][straight.el]], the next-generation, purely functional
;; package manager for the Emacs hacker is used and to load them, [[https://github.com/jwiegley/use-package][use-package]] is
;; used and integrated to straight.


(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el"
                         user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

;; ~use-package~

;; Using straight, we can now download, install and load /use-package/.


(straight-use-package 'use-package)
(setq straight-use-package-by-default t)
(setq use-package-verbose t)

;; ~evil~
;; :PROPERTIES:
;; :Custom_ID: user-interface--keybindings--evil
;; :END:

;; #+begin_quote
;; Now you see that evil will always triumph, because good is dumb. -- Dark Helmet
;; #+end_quote


(use-package evil
  :custom
  (evil-want-integration t)
  (evil-want-keybinding nil)
  (evil-want-C-u-scroll t)
  (evil-want-C-i-jump nil)
  (evil-respect-visual-line-mode t)

  :config
  (evil-mode 1))

;; ~evil-collection~
;; :PROPERTIES:
;; :Custom_ID: user-interface--keybindings--evil-collection
;; :END:


(use-package evil-collection
  :defer t
  :after evil

  :custom
  (evil-collection-outline-bind-tab-p nil))

;; ~hydra~
;; :PROPERTIES:
;; :Custom_ID: user-interface--keybindings--hydra
;; :END:

;; #+begin_quote
;; make Emacs bindings that stick around. -- [[https://github.com/abo-abo/hydra][hydra]]
;; #+end_quote


(use-package hydra
  :defer t)

;; ~which-key~
;; :PROPERTIES:
;; :Custom_ID: use-package--which-key
;; :END:

;; #+begin_quote
;; Emacs package that displays available keybindings in popup. -- [[https://github.com/justbur/emacs-which-key][which-key]]
;; #+end_quote


(use-package which-key
  :custom
  (which-key-idle-delay 0.3)

  :config
  (which-key-mode))

;; ~general~
;; :PROPERTIES:
;; :Custom_ID: use-package--general
;; :END:

;; #+begin_quote
;; More convenient key definitions in emacs. -- [[https://github.com/noctuid/general.el][general.el]]
;; #+end_quote


(use-package general
  :config
  (general-evil-setup t))

;; Keybindings
;; :PROPERTIES:
;; :Custom_ID: user-interface--keybindings
;; :END:
