.config/emacs/init.el


(defvar medivhok:leader-key "SPC"
  "The leader key.")

(defconst medivhok:non-normal-leader-key "M-SPC"
  "The 'non normal state' leader key.")

(defun medivhok/expand-menu-key (menu-key &optional non-normal-menu-key)
  "Returns a string of the MENU-KEY prefixed by `medivhok:leader-key' and
a space. If NON-NORMAL-MENU-KEY is non nil, `medivhok:non-local-leader-key'
is used instead."
  (if (null non-normal-menu-key)
      (concat medivhok:leader-key " " menu-key)
    (concat medivhok:non-normal-leader-key " " menu-key)))



;; ~medivhok:leader-menu~

(defhydra hydra-zoom ()
  "zoom"
  ("-" text-scale-decrease "out")
  ("=" text-scale-increase "in"))

(general-create-definer medivhok:main-menu
  :prefix medivhok:leader-key
  :non-normal-prefix medivhok:non-normal-leader-key)

(medivhok:main-menu 'normal
  ":" 'execute-extended-command
  "-" '(hydra-zoom/text-scale-decrease
        :which-key "text-scale-decrease")
  "=" '(hydra-zoom/text-scale-increase
        :which-key "text-scale-increase"))



;; ~medivhok:local-mode-menu~

(general-create-definer medivhok:local-mode-menu
  :prefix (medivhok/expand-menu-key "m")
  :non-normal-prefix (medivhok/expand-menu-key "m" t))



;; ~medivhok:applications-menu~

(general-create-definer medivhok:applications-menu
  :prefix (medivhok/expand-menu-key "a")
  :non-normal-prefix (medivhok/expand-menu-key "a" t)
  nil '(:ignore t :which-key "applications"))



;; ~medivhok:buffer-menu~

(general-create-definer medivhok:buffer-menu
  :prefix (medivhok/expand-menu-key "b")
  :non-normal-prefix (medivhok/expand-menu-key "b" t)
  nil '(:ignore t :which-key "buffer"))

(medivhok:buffer-menu 'normal
  "b" 'switch-to-buffer
  "k" 'kill-buffer
  "d" 'kill-current-buffer)



;; ~medivhok:emacs-menu~

(general-create-definer medivhok:emacs-menu
  :prefix (medivhok/expand-menu-key "e")
  :non-normal-prefix (medivhok/expand-menu-key "e" t)
  nil '(:ignore t :which-key "emacs"))

(medivhok:emacs-menu 'normal
  "e" '((lambda ()
          (interactive)
          (find-file
           (expand-file-name "README.org"
                             (file-name-directory user-init-file))))
        :which-key "edit literate config")
  "E" '((lambda ()
          (interactive)
          (find-file
           (expand-file-name "init.el"
                             (file-name-directory user-init-file))))
        :which-key "edit config"))



;; ~medivhok:file-menu~

(general-create-definer medivhok:file-menu
  :prefix (medivhok/expand-menu-key "f")
  :non-normal-prefix (medivhok/expand-menu-key "f" t)
  nil '(:ignore t :which-key "file"))

(medivhok:file-menu 'normal
  "f" 'find-file
  "r" 'counsel-recentf)



;; ~medivhok:help-menu~

(general-create-definer medivhok:help-menu
  :prefix (medivhok/expand-menu-key "h")
  :non-normal-prefix (medivhok/expand-menu-key "h" t)
  nil '(:ignore t :which-key "help"))

(medivhok:help-menu 'normal
  "a" 'apropos-command
  "b" 'describe-bindings
  "f" 'describe-function
  "i" 'info
  "k" 'general-describe-keybindings
  "s" 'counsel-describe-symbol
  "v" 'describe-variable)



;; ~medivhok:notes-menu~

(general-create-definer medivhok:notes-menu
  :prefix (medivhok/expand-menu-key "n")
  :non-normal-prefix (medivhok/expand-menu-key "n" t)
  nil '(:ignore t :which-key "notes"))



;; ~medivhok:window-menu~

(general-create-definer medivhok:window-menu
  :prefix (medivhok/expand-menu-key "w")
  :non-normal-prefix (medivhok/expand-menu-key "w" t)
  nil '(:ignore t :which-key "window"))

(medivhok:window-menu 'normal
  "q" 'delete-window
  "s" 'split-window-below)



;; ~medivhok:quit-menu~

(general-create-definer medivhok:quit-menu
  :prefix (medivhok/expand-menu-key "q")
  :non-normal-prefix (medivhok/expand-menu-key "q" t)
  nil '(:ignore t :which-key "quit"))

(medivhok:quit-menu 'normal
  "q" 'save-buffers-kill-terminal)

;; ~all-the-icons~
;; :PROPERTIES:
;; :Custom_ID: use-package--all-the-icons
;; :END:

;; #+begin_quote
;; A utility package to collect various Icon Fonts and propertize them within Emacs. -- [[https://github.com/domtronn/all-the-icons.el][all-the-icons]]
;; #+end_quote


(use-package all-the-icons

;; Preface (~:preface~)
;; :PROPERTIES:
;; :Custom_ID: use-package--all-the-icons--preface
;; :END:

;; #+begin_quote
;; NOTE: This code is executed right away.
;; #+end_quote

;; We start the [[https://github.com/jwiegley/use-package#add-preface-occurring-before-everything-except-disabled][:preface]] section of the [[#use-package--all-the-icons][use-package]].

;; Show some nice symbols (ex.: ~lambda~ becomes $\lambda$)


:preface
(global-prettify-symbols-mode 1)

;; Closing Paren


)

;; ~amx~
;; :PROPERTIES:
;; :Custom_ID: use-package--amx
;; :END:

;; #+begin_quote
;; An alternative M-x interface for Emacs. -- [[https://github.com/DarwinAwardWinner/amx][amx]]
;; #+end_quote


(use-package amx
  :after ivy

  :custom
  (amx-backend 'ivy)

  :config
  (amx-mode))

;; ~counsel~
;; :PROPERTIES:
;; :Custom_ID: use-package--counsel
;; :END:

;; #+begin_quote
;; Ivy - a generic completion frontend for Emacs, Swiper - isearch with an
;; overview, and more. Oh, man! -- [[https://github.com/abo-abo/swiper][swiper]]
;; #+end_quote

;; #+begin_center
;; NOTE: By installing ~counsel~, ~ivy~ and ~swiper~ will automatically be installed as
;; dependencies.
;; #+end_center


(use-package counsel

;; Load Package After... (~:after~)
;; :PROPERTIES:
;; :Custom_ID: use-package--counsel--after
;; :END:

;; We start the [[https://github.com/jwiegley/use-package#loading-packages-in-sequence][:after]] section of the [[#use-package--counsel][use-package]].


:after evil-collection

;; Configurations (~:config~)
;; :PROPERTIES:
;; :Custom_ID: use-package--counsel--config
;; :END:

;; #+begin_quote
;; NOTE: This code is executed AFTER the package is loaded.
;; #+end_quote

;; We start the [[https://github.com/jwiegley/use-package#getting-started][:config]] section of the [[#use-package--counsel][use-package]].


:config
(evil-collection-init 'ivy)
(setq ivy-use-virtual-buffers t
      ivy-count-format "(%d/%d) ")
(ivy-mode 1)
(counsel-mode 1)

;; Closing Paren


)

;; ~ivy-rich~
;; :PROPERTIES:
;; :Custom_ID: use-package--ivy-rich
;; :END:

;; #+begin_quote
;; More friendly interface for ivy. -- [[https://github.com/Yevgnen/ivy-rich][ivy-rich]]
;; #+end_quote


(use-package ivy-rich

;; Load Package After... (~:after~)
;; :PROPERTIES:
;; :Custom_ID: use-package--ivy-rich--after
;; :END:

;; We start the [[https://github.com/jwiegley/use-package#loading-packages-in-sequence][:after]] section of the [[#use-package--ivy-rich][use-package]].


:after ivy

;; Configurations (~:config~)
;; :PROPERTIES:
;; :Custom_ID: use-package--ivy-rich--config
;; :END:

;; #+begin_quote
;; NOTE: This code is executed AFTER the package is loaded.
;; #+end_quote

;; We start the [[https://github.com/jwiegley/use-package#getting-started][:config]] section of the [[#use-package--ivy-rich][use-package]].


:config
(ivy-rich-mode 1)
(setcdr (assq t ivy-format-functions-alist) #'ivy-format-function-line)

;; Closing Paren


)

;; ~ivy-posframe~

;; #+begin_quote
;; ivy-posframe is a ivy extension, which let ivy use posframe to show
;; its candidate menu. -- [[https://github.com/tumashu/ivy-posframe][ivy-posframe]]
;; #+end_quote


(use-package ivy-posframe
  :after ivy

  :custom
  (ivy-posframe-display-functions-alist
   '((t . ivy-posframe-display-at-frame-center)))

  :config
  (ivy-posframe-mode 1))

;; ~company~
;; :PROPERTIES:
;; :Custom_ID: use-package--company
;; :END:

;; #+begin_quote
