.config/emacs/init.el
;; Modular in-buffer completion framework for Emacs. -- [[https://github.com/company-mode/company-mode][company-mode]]
;; #+end_quote


(use-package company

;; Hooks (~:hook~)
;; :PROPERTIES:
;; :Custom_ID: use-package--company--hook
;; :END:

;; We start the [[https://github.com/jwiegley/use-package#hooks][:hook]] section of our [[#use-package--company][use-package]] definition.


:hook
(after-init . global-company-mode)

;; Commands This Package Provides (~:commands~)
;; :PROPERTIES:
;; :Custom_ID: use-package--company--commands
;; :END:

;; We start the [[https://github.com/jwiegley/use-package#key-binding][:commands]] section of our [[#use-package--company][use-package]] definition.


:commands
(company-complete-common
 company-manual-begin
 company-grab-line)

;; Configurations (~:config~)
;; :PROPERTIES:
;; :Custom_ID: use-package--company--config
;; :END:

;; #+begin_quote
;; NOTE: This code is executed AFTER the package is loaded.
;; #+end_quote

;; We start the [[https://github.com/jwiegley/use-package#getting-started][:config]] section of the [[#use-package--company][use-package]].


:config
(setq company-box-icons-all-the-icons
      (let ((all-the-icons-scale-factor 0.8))
        `((Unknown       . ,(all-the-icons-material "find_in_page"             :face 'all-the-icons-purple))
          (Text          . ,(all-the-icons-material "text_fields"              :face 'all-the-icons-green))
          (Method        . ,(all-the-icons-material "functions"                :face 'all-the-icons-red))
          (Function      . ,(all-the-icons-material "functions"                :face 'all-the-icons-red))
          (Constructor   . ,(all-the-icons-material "functions"                :face 'all-the-icons-red))
          (Field         . ,(all-the-icons-material "functions"                :face 'all-the-icons-red))
          (Variable      . ,(all-the-icons-material "adjust"                   :face 'all-the-icons-blue))
          (Class         . ,(all-the-icons-material "class"                    :face 'all-the-icons-red))
          (Interface     . ,(all-the-icons-material "settings_input_component" :face 'all-the-icons-red))
          (Module        . ,(all-the-icons-material "view_module"              :face 'all-the-icons-red))
          (Property      . ,(all-the-icons-material "settings"                 :face 'all-the-icons-red))
          (Unit          . ,(all-the-icons-material "straighten"               :face 'all-the-icons-red))
          (Value         . ,(all-the-icons-material "filter_1"                 :face 'all-the-icons-red))
          (Enum          . ,(all-the-icons-material "plus_one"                 :face 'all-the-icons-red))
          (Keyword       . ,(all-the-icons-material "filter_center_focus"      :face 'all-the-icons-red))
          (Snippet       . ,(all-the-icons-material "short_text"               :face 'all-the-icons-red))
          (Color         . ,(all-the-icons-material "color_lens"               :face 'all-the-icons-red))
          (File          . ,(all-the-icons-material "insert_drive_file"        :face 'all-the-icons-red))
          (Reference     . ,(all-the-icons-material "collections_bookmark"     :face 'all-the-icons-red))
          (Folder        . ,(all-the-icons-material "folder"                   :face 'all-the-icons-red))
          (EnumMember    . ,(all-the-icons-material "people"                   :face 'all-the-icons-red))
          (Constant      . ,(all-the-icons-material "pause_circle_filled"      :face 'all-the-icons-red))
          (Struct        . ,(all-the-icons-material "streetview"               :face 'all-the-icons-red))
          (Event         . ,(all-the-icons-material "event"                    :face 'all-the-icons-red))
          (Operator      . ,(all-the-icons-material "control_point"            :face 'all-the-icons-red))
          (TypeParameter . ,(all-the-icons-material "class"                    :face 'all-the-icons-red))
          (Template      . ,(all-the-icons-material "short_text"               :face 'all-the-icons-green))
          (ElispFunction . ,(all-the-icons-material "functions"                :face 'all-the-icons-red))
          (ElispVariable . ,(all-the-icons-material "check_circle"             :face 'all-the-icons-blue))
          (ElispFeature  . ,(all-the-icons-material "stars"                    :face 'all-the-icons-orange))
          (ElispFace     . ,(all-the-icons-material "format_paint"             :face 'all-the-icons-pink)))))

(defun medivhok/company-backend-with-yas (backends)
  "Add :with company-yasnippet to company BACKENDS.
Taken from https://github.com/syl20bnr/spacemacs/pull/179."
  (if (and (listp backends) (memq 'company-yasnippet backends))
	    backends
	  (append (if (consp backends)
		            backends
		          (list backends))
		        '(:with company-yasnippet))))

;; add yasnippet to all backends
(setq company-backends
      (mapcar #'medivhok/company-backend-with-yas company-backends))

;; Closing Paren


)

;; ~company-dict~
;; :PROPERTIES:
;; :Custom_ID: use-package--company-dict
;; :END:

;; #+begin_quote
;; A port of ac-source-dictionary to company-mode, plus annotation and documentation support. -- [[https://github.com/hlissner/emacs-company-dict][company-dict]]
;; #+end_quote


(use-package company-dict

;; Preface (~:preface~)
;; :PROPERTIES:
;; :Custom_ID: use-package--company-dict--preface
;; :END:

;; #+begin_quote
;; NOTE: This code is executed right away.
;; #+end_quote

;; We start the [[https://github.com/jwiegley/use-package#add-preface-occurring-before-everything-except-disabled][:preface]] section of the [[#use-package--company-dict][use-package]].


:preface

;; Load Package After... (~:after~)
;; :PROPERTIES:
;; :Custom_ID: use-package--company-dict--after
;; :END:

;; We start the [[https://github.com/jwiegley/use-package#loading-packages-in-sequence][:after]] section of the [[#use-package--company-dict][use-package]].


:after company

;; Initializations (~:init~)
;; :PROPERTIES:
;; :Custom_ID: use-package--company-dict--init
;; :END:

;; #+begin_quote
;; NOTE: This code is executed BEFORE the package is loaded.
;; #+end_quote

;; We start the [[https://github.com/jwiegley/use-package#getting-started][:init]] section of our [[#use-package--company-dict][use-package]] definition.


:init

;; Configurations (~:config~)
;; :PROPERTIES:
;; :Custom_ID: use-package--company-dict--config
;; :END:

;; #+begin_quote
;; NOTE: This code is executed AFTER the package is loaded.
;; #+end_quote

;; We start the [[https://github.com/jwiegley/use-package#getting-started][:config]] section of the [[#use-package--company-dict][use-package]].


:config

;; Closing Paren


)

;; ~company-box~
;; :PROPERTIES:
;; :Custom_ID: use-package--company-box
;; :END:

;; #+begin_quote
;; A company front-end with icons. -- [[https://github.com/sebastiencs/company-box][company-box]]
;; #+end_quote


(use-package company-box

;; Preface (~:preface~)
;; :PROPERTIES:
;; :Custom_ID: use-package--company-box--preface
;; :END:

;; #+begin_quote
;; NOTE: This code is executed right away.
;; #+end_quote

;; We start the [[https://github.com/jwiegley/use-package#add-preface-occurring-before-everything-except-disabled][:preface]] section of the [[#use-package--company-box][use-package]].


:preface

;; Load Package After... (~:after~)
;; :PROPERTIES:
;; :Custom_ID: use-package--company-box--after
;; :END:

;; We start the [[https://github.com/jwiegley/use-package#loading-packages-in-sequence][:after]] section of the [[#use-package--company-box][use-package]].


:after company

;; Hooks (~:hook~)
;; :PROPERTIES:
