.config/emacs/init.el
;; :Custom_ID: use-package--company-box--hook
;; :END:

;; We start the [[https://github.com/jwiegley/use-package#hooks][:hook]] section of our [[#use-package--company-box][use-package]] definition.


:hook
(company-mode . company-box-mode)

;; Initializations (~:init~)
;; :PROPERTIES:
;; :Custom_ID: use-package--company-box--init
;; :END:

;; #+begin_quote
;; NOTE: This code is executed BEFORE the package is loaded.
;; #+end_quote

;; We start the [[https://github.com/jwiegley/use-package#getting-started][:init]] section of our [[#use-package--company-box][use-package]] definition.


:init

;; Configurations (~:config~)
;; :PROPERTIES:
;; :Custom_ID: use-package--company-box--config
;; :END:

;; #+begin_quote
;; NOTE: This code is executed AFTER the package is loaded.
;; #+end_quote

;; We start the [[https://github.com/jwiegley/use-package#getting-started][:config]] section of the [[#use-package--company-box][use-package]].


:config

;; Closing Paren


)

;; Fonts

;; The fonts.

(set-face-attribute 'default nil
                    :font "Hack Nerd Font"
                    :height 130)
(set-face-attribute 'fixed-pitch nil
                    :font "DroidSansMono Nerd Font"
                    :height 120)
(set-face-attribute 'variable-pitch nil
                    :font "Hack Nerd Font"
                    :height 130
                    :weight 'regular)

;; Dashboard


(use-package dashboard
  :preface
  (setq inhibit-startup-message t)

  :config
  (dashboard-setup-startup-hook)
  (setq dashboard-startup-banner 'logo
        dashboard-items '((recents . 5)
                          (agenda . 5)))
  (evil-collection-init 'dashboard))

;; Frames

;; Set the frame transparency.


(set-frame-parameter (selected-frame) 'alpha '(90 . 90))
(add-to-list 'default-frame-alist '(alpha . (90 . 90)))



;; Maximize windows by default.


(set-frame-parameter (selected-frame) 'fullscreen 'maximized)
(add-to-list 'default-frame-alist '(fullscreen . maximized))



;; Disable the scroll bar and tooltips.


(scroll-bar-mode -1)
(tooltip-mode -1)

;; We disable the tool and menu bar.
(tool-bar-mode -1)
(menu-bar-mode -1)



;; Give some breathing room.


(set-fringe-mode 10)



;; Set up the visible bell.


(setq visible-bell t)



;; Highlight current line.


(global-hl-line-mode t)



;; Improve scrolling.


;; One line at a time.
(setq mouse-wheel-scroll-amount '(1 ((shift) . 1)))

;; Don't accelerate scrolling.
(setq mouse-wheel-progressive-speed nil)

;; Scroll window under mouse.
(setq mouse-wheel-follow-mouse 't)

;; Keyboard scroll one line at a time.
(setq scroll-step 1)



;; Line and column numbers.


(setq display-line-numbers-type 'relative
      display-line-numbers-width-start t)
(global-display-line-numbers-mode t)
(column-number-mode)



;; Time format.


(setq display-time-format "%l:%M %p %b %y"
      display-time-default-load-average nil)

(setq-default fill-column 80)

;; doom-modeline


(use-package doom-modeline
  :hook
  (window-setup . doom-modeline-mode)

  ;; :custom-face
  ;; (mode-line ((t (:height 0.85))))
  ;; (mode-line-inactive ((t (:height 0.85))))

  :init
  (setq doom-modeline-bar-width 6
        doom-modeline-buffer-file-name-style 'auto
        doom-modeline-buffer-state-icon t
        doom-modeline-github nil
        doom-modeline-height 15
        doom-modeline-icon (display-graphic-p)
        doom-modeline-irc nil
        doom-modeline-lsp t
        doom-modeline-major-mode-icon t
        doom-modeline-major-mode-color-icon t
        doom-modeline-minor-modes t
        doom-modeline-mu4e nil
        doom-modeline-persp-name nil
        doom-modeline-project-detection 'projectile))

;; minions

;; Configuration of the modeline.


(use-package minions
  :init
  (setq minions-mode-line-lighter " ")

  :config
  (minions-mode 1))

;; Notifications

;; Don't warn for large files.


(setq large-file-warning-threshold nil)



;; Don't warn for following symlinked files.


(setq vc-follow-symlinks t)



;; Don't warn when advice is added for functions.


(setq ad-redefinition-action 'accept)

;; Help Interface (~helpful~)


(use-package helpful
  :after
  (counsel evil-collection)

  :config
  (evil-collection-init 'helpful)
  (setq counsel-describe-function-function #'helpful-callable
        counsel-describe-variable-function #'helpful-variable))

;; Theme

;; We configure the theme.

(use-package doom-themes
  :config
  (setq doom-themes-enable-bold t
	      doom-themes-enable-italic t)
  (load-theme 'doom-one t)

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)

  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))

;; Helm Completions

;; #+begin_quote
;; Emacs incremental completion and selection narrowing framework. -- [[https://github.com/emacs-helm/helm][helm]]
;; #+end_quote


(use-package helm
  :defer t
  :config
  (require 'helm-config))

;; Generic Editing Configurations
;; Default to an indentation size of 2 spaces.

(setq-default tab-width 2)
(setq-default evil-shift-with tab-width)
(global-auto-revert-mode t)



;; Use spaces instead of tabs for indentation.

(setq-default indent-tabs-mode nil)

;; Folding (~hideshow~)

(use-package hideshow)

;; Parens & Co. (~smartparens~)

;; #+begin_quote
;; Minor mode for Emacs that deals with parens pairs and tries to be smart about it.
;; #+end_quote


(use-package smartparens
  :hook
  (prog-mode . smartparens-mode)
  (prog-mode . smartparens-strict-mode)

  :config
  (require 'smartparens-config))

;; evil-nerd-commenter

;; Commenting lines.

(use-package evil-nerd-commenter
  :bind
  ("M-/" . evilnc-comment-or-uncomment-lines))

;; ws-butler

;; Automatically clean whitespace.

(use-package ws-butler
  :hook
  ((text-mode . ws-butler-mode)
   (prog-mode . ws-butler-mode)))

;; parinfer

;; Use Parinfer for Lispy languages.

(use-package parinfer
  :hook ((clojure-mode . parinfer-mode)
         (emacs-lisp-mode . parinfer-mode)
         (common-lisp-mode . parinfer-mode)
         (scheme-mode . parinfer-mode)
         (lisp-mode . parinfer-mode))
  :config
  (setq parinfer-extensions
      '(defaults       ; should be included.
        pretty-parens  ; different paren styles for different modes.
        evil           ; If you use Evil.
        smart-tab      ; C-b & C-f jump positions and smart shift with tab & S-tab.
        smart-yank)))  ; Yank behavior depend on mode.

;; rainbow-delimiters


(use-package rainbow-delimiters
  :hook
  (prog-mode . rainbow-delimiters-mode))

;; ~yasnippet~
;; :PROPERTIES:
;; :Custom_ID: use-package--yasnippet
;; :END:

;; #+begin_quote
;; A template system for Emacs. -- [[https://github.com/joaotavora/yasnippet][yasnippet]]
;; #+end_quote


(use-package yasnippet
  :custom
  (yas-snippet-dirs
     (list
      (file-name-as-directory
       (expand-file-name "snippets"
                         (file-name-directory user-init-file)))))
  :general
  :config
