docs/Emacs.org
**** Configurations (~:config~)
:PROPERTIES:
:Custom_ID: use-package--yasnippet--config
:END:

#+begin_quote
NOTE: This code is executed AFTER the package is loaded.
#+end_quote

We start the [[https://github.com/jwiegley/use-package#getting-started][:config]] section of the [[#use-package--yasnippet][use-package]].

#+begin_src emacs-lisp :tangle no :noweb-ref use-package:yasnippet
:config
(yas-global-mode 1)
#+end_src

** Code Completions
** Git (~magit~)
*** magit

#+begin_src emacs-lisp
(use-package magit
  :commands
  (magit-status magit-get-current-branch)

  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-execpt-diff-v1))
#+end_src

*** evil-magit

#+begin_src emacs-lisp
(use-package evil-magit
  :after magit)
#+end_src

*** git-gutter

#+begin_src emacs-lisp
(use-package git-gutter
  :hook
  ((text-mode . git-gutter-mode)
   (prog-mode . git-gutter-mode))

  :config
  (setq git-gutter:update-interval 2))
#+end_src

*** git-link

#+begin_src emacs-lisp
(use-package git-link
  :commands git-link

  :config
  (setq git-link-open-in-browser t))
#+end_src

*** magit-todos

#+begin_src emacs-lisp
(use-package magit-todos
  :after magit)
#+end_src

** Project Management (~projectile~)
*** projectile

#+begin_src emacs-lisp
(use-package projectile
  :config
  (projectile-mode))
#+end_src

*** counsel-projectile

#+begin_src emacs-lisp
(use-package counsel-projectile
  :after projectile)
#+end_src

** Syntax Checking (~flycheck~)

#+begin_src emacs-lisp
(use-package flycheck
  :config (global-flycheck-mode))
#+end_src

* Org Applications
** Org Mode
:PROPERTIES:
:package_name: org-mode
:package_url: https://orgmode.org
:END:

#+begin_quote
Org mode is for keeping notes, maintaining TODO lists, planning projects, and
authoring documents with a fast and effective plain-text system. -- [[https://orgmode.org/][org]]
#+end_quote

Automatically /tangle/ on save. Handy tip from [[https://leanpub.com/lit-config/read#leanpub-auto-configuring-emacs-and--org-mode-for-literate-programming][this book]] on literate programming.
We will add this function to the ~after-save-hook~ of /org/ files in the next
function.


Customizations to apply to each ~org-mode~ buffers. This function was added to
the ~org-mode-hook~.

#+begin_src emacs-lisp
(use-package org
  :hook
  (org-mode . (lambda ()
                (org-indent-mode)
                (variable-pitch-mode 1)
                (auto-fill-mode 0)
                (visual-line-mode 1)
                (setq evil-auto-indent nil)

                ;; Automatically tangle on save.
                (add-hook 'after-save-hook
                          #'medivhok/org-babel-tangle-dont-ask
                          (lambda ()
                            (let
                                ((org-confirm-babel-evaluate nil))
                              (org-babel-tangle)))
                          'run-at-end
                          'only-in-org-mode)))

  :custom
  (org-catch-invisible-edits 'show)
  (org-cycle-separator-lines 2)
  (org-directory "~/org/")
  (org-edit-src-content-indentation 0)
  (org-ellipsis " ▼")
  (org-hide-block-startup nil)
  (org-hide-emphasis-markers t)
  (org-log-done 'time)
  (org-log-into-drawer t)
  (org-outline-path-complete-in-steps nil)
  (org-return-follows-link t)
  (org-src-fontify-natively t)
  (org-src-preserve-indentation nil)
  (org-src-tab-acts-natively t)
  (org-src-window-setup 'current-window)
  (org-startup-folded t)

  :custom-face
  (org-link ((t (:inherit link :underline nil))))

  :general
  (medivhok:local-mode-menu 'normal
    org-mode-map
    nil '(:ignore t :which-key "org")
    "e" 'org-export-dispatch
    "t" '(:ignore t :which-key "toggle")
    "tl" 'org-toggle-link-display)

  :config
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (haskell . t)
     (ledger . t)
     (R . t)))

  (add-hook 'org-src-mode-hook
            (lambda ()
              (when (eq major-mode 'emacs-lisp-mode)
                (setq flycheck-disabled-checkers '(emacs-lisp-checkdoc)))))

  ;; Replace list hyphen with dot.
  (require 'org-indent)
  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))
  (dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)))
  (set-face-attribute (car face) nil :font "Cantarell" :weight 'regular :height (cdr face)))

  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))
#+end_src

** Org Enhancements
*** Org Evilification (~evil-org~)

#+begin_quote
Supplemental evil-mode keybindings to emacs org-mode. -- [[https://github.com/Somelauw/evil-org-mode/][evil-org]]
#+end_quote

#+begin_src emacs-lisp :noweb no-export
(use-package evil-org
  <<use-package:evil-org>>
  )
#+end_src

**** Hooks (~:hook~)
:PROPERTIES:
:Custom_ID: use-package--evil-org--hook
:END:

We start the [[https://github.com/jwiegley/use-package#hooks][:hook]] section of our [[#use-package--evil-org][use-package]] definition.

#+begin_src emacs-lisp :tangle no :noweb-ref use-package:evil-org
:hook
#+end_src

#+begin_src emacs-lisp :tangle no :noweb-ref use-package:evil-org
((org-mode . evil-org-mode)
 (org-agenda-mode . evil-org-mode)
 (evil-org-mode . (lambda ()
	(evil-org-set-key-theme))))
#+end_src

**** Configurations (~:config~)
:PROPERTIES:
:Custom_ID: use-package--evil-org--config
:END:

#+begin_quote
NOTE: This code is executed AFTER the package is loaded.
#+end_quote

We start the [[https://github.com/jwiegley/use-package#getting-started][:config]] section of the [[#use-package--evil-org][use-package]].

#+begin_src emacs-lisp :tangle no :noweb-ref use-package:org
:config
#+end_src

#+begin_src emacs-lisp :tangle no :noweb-ref evil-org:config
(require 'evil-org-agenda)
(evil-org-agenda-set-keys)
#+end_src

*** Better Dots (~org-bullets~)
:PROPERTIES:
:Custom_ID: use-package--org-bullets
:END:

#+begin_quote
utf-8 bullets for org-mode. -- [[https://github.com/sabof/org-bullets/][org-bullets]]
#+end_quote

Use bullet characters instead of asterisks, plus set the header font sizes to
something more palatable.

#+begin_src emacs-lisp :noweb no-export
(use-package org-bullets
  <<use-package:org-bullets>>
  )
#+end_src

**** Hooks (~:hook~)
:PROPERTIES:
:Custom_ID: use-package--org-bullets--hook
:END:

We start the [[https://github.com/jwiegley/use-package#hooks][:hook]] section of our [[#use-package--org-bullets][use-package]] definition.

#+begin_src emacs-lisp :tangle no :noweb-ref use-package:org-bullets
:hook
#+end_src

#+begin_src emacs-lisp :tangle no :noweb-ref use-package:org-bullets
(org-mode . org-bullets-mode)
#+end_src

**** Custom Variables (~:custom~)
:PROPERTIES:
:Custom_ID: use-package--org-bullets--custom
:END:

We start the [[https://github.com/jwiegley/use-package#customizing-variables][:custom]] section of our [[#use-package--org-bullets][use-package]] definition.

#+begin_src emacs-lisp :tangle no :noweb-ref use-package:org-bullets
:custom
#+end_src

#+begin_src emacs-lisp :tangle no :noweb-ref use-package:org-bullets
(org-bullets-bullet-list '("◉" "●" "○" "▶" "☰" "▷" "○"))
#+end_src

*** Table of Contents Generator (~org-make-toc~)

#+begin_quote
Automatic tables of contents for Org files. -- [[https://github.com/alphapapa/org-make-toc/][org-make-toc]]
#+end_quote

It’s nice to have a table of contents section for long literate configuration
files (like this one!) so I use [[https://github.com/alphapapa/org-make-toc][org-make-toc]] to automatically update the ToC in
any header with a property named TOC.

#+begin_src emacs-lisp :noweb no-export
(use-package org-make-toc
  <<use-package:org-make-toc>>
  )
#+end_src

**** Hooks (~:hook~)
:PROPERTIES:
:Custom_ID: use-package--org-make-toc--hook
:END:

We start the [[https://github.com/jwiegley/use-package#hooks][:hook]] section of our [[#use-package--org-make-toc][use-package]] definition.

#+begin_src emacs-lisp :tangle no :noweb-ref use-package:org-make-toc
:hook
#+end_src

#+begin_src emacs-lisp :tangle no :noweb-ref use-package:org-make-toc
(org-mode . org-make-toc-mode)
#+end_src

