.config/emacs/init.el
;; :Custom_ID: use-package--ox-odt
;; :END:


(use-package ox-odt
  :after org

  :straight
  (org :type git :local-repo "org")

  :custom
  (org-odt-convert-process "unoconv")
  (org-odt-convert-processes '(("unoconv"
                                "unoconv -f %f %i")))
  (org-odt-preferred-output-format "docx")
  (org-odt-prettify-xml t)

  :config
  (org-odt-add-automatic-style "TNOrgTitle"
                               '(("style:family" "paragraph")
                                 ("style:parent-style-name" "OrgTitle")
                                 ("style:master-page-name" "OrgTitlePage"))))

;; Shared Constants
;; :PROPERTIES:
;; :Custom_ID: applications-variables
;; :END:

;; Here we define variables and constants that can be used by all application
;; contexts.


(defconst medivhok:app-directory
  (file-name-as-directory "~/org/")
  "The root directory of my applications files.")

;; Documents Reader (PDF)

;; #+begin_quote
;; Emacs support library for PDF files. -- [[https://github.com/politza/pdf-tools/][pdf-tools]]
;; #+end_quote


(use-package pdf-tools
  :defer t
  :config
  (pdf-loader-install)
  (evil-collection-init 'pdf))

;; Variables & Constants
;; :PROPERTIES:
;; :Custom_ID: applications-agenda-variables
;; :END:

;; Variables and constants that are gonna be used only by the /agenda application
;; context/.


(defconst medivhok:agenda-directory
  (file-name-as-directory
   (expand-file-name "agenda" medivhok:app-directory))
  "The directory of my agenda files.")

(defconst medivhok:gtd-file
  (expand-file-name "gtd.org" medivhok:agenda-directory)
  "My 'getting things done' agenda file.")

;; ~org-agenda~
;; :PROPERTIES:
;; :Custom_ID: use-package--org-agenda
;; :END:

;; The environment of the /GTD/ workflow is done with ~org-agenda~, which is part of
;; the [[https://orgmode.org][Org Mode]] ecosystem.


(defun medivhok/open-agenda ()
  "Opens my GTD agenda."
  (interactive)
  (org-agenda nil " "))



;; #+begin_quote
;; #+end_quote


(use-package org-agenda

;; Get Package From... (~:straight~)
;; :PROPERTIES:
;; :Custom_ID: use-package--org-agenda--straight
;; :END:

;; We start the [[https://github.com/raxod502/straight.el#integration-with-use-package][:straight]] section of the [[#use-package--org-agenda][use-package]].


:straight org

;; Commands This Package Provides (~:commands~)
;; :PROPERTIES:
;; :Custom_ID: use-package--org-agenda--commands
;; :END:

;; We start the [[https://github.com/jwiegley/use-package#key-binding][:commands]] section of our [[#use-package--org-agenda][use-package]] definition.


:commands
(org-agenda)

;; Custom Variables (~:custom~)
;; :PROPERTIES:
;; :Custom_ID: use-package--org-agenda--custom
;; :END:

;; We start the [[https://github.com/jwiegley/use-package#customizing-variables][:custom]] section of our [[#use-package--org-agenda][use-package]] definition.


:custom
(org-agenda-window-setup 'current-window)
(org-agenda-block-separator nil)
(org-agenda-dim-blocked-tasks 'invisible)
(org-agenda-files (list medivhok:gtd-file))
(org-agenda-skip-deadline-if-done t)
(org-agenda-skip-scheduled-if-done t)
(org-agenda-start-with-log-mode t)
(org-agenda-custom-commands
 `((" "
    "GTD Agenda"
    ((agenda ""
	     ((org-agenda-span 'week)
	      (org-deadline-warning-days 14)))
     (tags-todo "@inbox"
		((org-agenda-overriding-header "Inbox")))
     (tags-todo "@tâches"
		((org-agenda-overriding-header "Tâches")))
     (tags-todo "@teluq"
		((org-agenda-overriding-header "Teluq")))
     (tags-todo "@projets"
		((org-agenda-overriding-header "Projets")))))))

;; Closing Paren


)

;; ~org-capture~


(use-package org-capture
  :straight org

  :commands (org-capture)
  :bind
  (("<f4>" . (lambda () (interactive) (org-capture nil "i"))))

  :config
  (setq org-capture-templates
	`(("i" "inbox" entry
	   (file+headline ,medivhok:gtd-file "Inbox")
	   "* TODO [#C] %?\n:PROPERTIES:\n:Effort: 1\n:END:\n")

	  ("e" "email" entry
	   (file+headline ,medivhok:gtd-file "Emails")
	   "* TODO [#A] Reply: %a"
	   :immediate-finish t))))

;; ~org-refile~


(use-package org-refile
  :straight org

  :config
  (setq org-refile-allow-creating-parent-nodes 'confirm
	      org-refile-use-outline-path 'file
	      org-refile-targets '((nil :tag . "@tâches")
	                     	   (nil :tag . "@cours")
				   (nil :tag . "@projet")
				   (nil :tag . "@teluq"))))

;; The Notes And Glossaries Boxes
;; :PROPERTIES:
;; :package_name: org-roam
;; :package_url: https://orgroam.com
;; :END:

;; #+begin_quote
;; Rudimentary Roam replica with Org-mode. -- [[https://github.com/org-roam/org-roam][org-roam]]
;; #+end_quote


(use-package org-roam
  :after (org)

  :straight
  (org-roam :host github :repo "org-roam/org-roam")

  :hook
  (after-init . org-roam-mode)

  :preface
  (setq org-roam-directory
        (file-name-as-directory
         (expand-file-name "slip-boxes" org-directory)))

  (defconst medivhok:notes-directory
    (file-name-as-directory
     (expand-file-name "notes" org-roam-directory))
    "The slip box with my notes cards.")

  (defconst medivhok:annotated-bibliography-directory
    (file-name-as-directory
     (expand-file-name "annotated-bibliography" org-roam-directory))
    "The slip box with my annotated bibliography cards.")

  (defconst medivhok:glossaries-directory
    (file-name-as-directory
     (expand-file-name "glossaries" org-roam-directory))
    "The slip box with my glossaries cards.")

  (defconst medivhok:card-templates-directory
    (file-name-as-directory
     (expand-file-name "templates" org-roam-directory))
    "The directory containing the card templates for my slip boxes.")

  :custom
  (org-roam-file-exclude-regexp "setupfiles\\|templates")
  (org-roam-index-file "index_file.org")
  (org-roam-tag-sources '(prop))
  (org-roam-title-sources '(title alias))
  (org-roam-capture-templates
   `(("n" "note card" plain
      (function org-roam--capture-get-point)
      "%?"
      :file-name "notes/${slug}"
      :head "#+TITLE: ${title}
#+CREATED: %T
#+LAST_MODIFIED: %T

- tags ::"
      :unnarrowed t)

     ("g" "glossaries card" plain
      (function org-roam--capture-get-point)
      (file ,(expand-file-name "glossary-card.org"
                             medivhok:card-templates-directory))
      :file-name "glossaries/${slug}"
      :head ""
      :unnarrowed t)))

  (org-roam-ref-capture-templates
   '(("r" "ref" plain (function org-roam-capture--get-point)
      "%?"
      :file-name "websites/${slug}"
      :head "#+TITLE: ${title}\n#+ROAM_KEY: ${ref}\n- source :: ${ref}"
      :unnarrowed t)))

  :general
  (medivhok:notes-menu 'normal
    "b" '(:ignore t :which-key "annotated bibliography")
    "bf" 'medivhok/find-annotated-bibliography-card
    "f" 'medivhok/find-note-card
    "g" '(:ignore t :which-key "glossaries")
    "gf" 'medivhok/find-glossary-card
    "G" 'org-roam-graph
    "i" 'org-roam-insert
    "r" 'org-roam-buffer-toggle-display)

  :init
  (setq time-stamp-active t
        time-stamp-pattern "-10/^#\\+LAST_MODIFIED: <%Y-%02m-%02d %a %02H:%02M>$"
        time-stamp-format "%Y-%02m-%02d %a %02H:%02M"))

;; ~bibtex-completion~


(use-package bibtex-completion
  :defer t
  :after org
  :custom
  (bibtex-completion-bibliography
   (expand-file-name
    "zotero.bib"
    (file-name-as-directory
     (expand-file-name "readings" org-directory))))
  (bibtex-completion-pdf-field "File"))

;; ~org-ref~


(use-package org-ref
  :after
  (org ivy-bibtex)

  :custom
