docs/Emacs.org
**** ~ivy-bibtex~
:PROPERTIES:
:Custom_ID: ivy-bibtex
:END:

#+begin_src emacs-lisp :tangle no
(use-package ivy-bibtex
  :after ivy
  :commands ivy-bibtex
  :bind ("<f3>" . ivy-bibtex)
  :custom
  (bibtex-completion-additional-search-fields '(keywords))
  (bibtex-completion-bibliography (list medivhok:bibtex-file))
  (bibtex-completion-cite-default-as-initial-input t)
  (bibtex-completion-notes-path medivhok:annotated-bibliography-directory)
  (bibtex-completion-pdf-field "file"))
#+end_src

**** ~org-ref~

#+begin_src emacs-lisp
(use-package org-ref
  :after
  (org ivy-bibtex)

  :custom
  (org-ref-completion-library 'org-ref-ivy-cite)
  (org-ref-default-bibliography bibtex-completion-bibliography)
  (org-ref-notes-directory medivhok:annotated-bibliography-directory))
#+end_src

**** ~org-roam-bibtex~
:PROPERTIES:
:Custom_ID: org-roam-bibtex
:END:

#+begin_quote
Connector between Org-roam, BibTeX-completion, and Org-ref. -- [[https://github.com/org-roam/org-roam-bibtex][org-roam-bibtex]]
#+end_quote

#+begin_src emacs-lisp
(use-package org-roam-bibtex
#+end_src

***** Get Package From... (~:straight~)
#+begin_src emacs-lisp
:straight
(org-roam-bibtex :host github :repo "org-roam/org-roam-bibtex")
#+end_src

***** Load Package After... (~:after~)
#+begin_src emacs-lisp
:after
(org-roam ivy-bibtex org-ref)
#+end_src

***** Add Some Hooks (~:hook~)
#+begin_src emacs-lisp
:hook
(org-roam-mode . org-roam-bibtex-mode)
#+end_src

***** Package Customizations (~:custom~)
#+begin_src emacs-lisp
:custom
(org-ref-notes-function 'orb-edit-notes)
(orb-preformat-keywords '(("citekey" . "=key=")
                          "title"
                          "url"
                          "file"
                          "author-or-editor"
                          "keywords"))
(orb-templates `(("r" "ref" plain (function org-roam-capture--get-point)
                  ""
                  :file-name "annotated-bibliography/${citekey}"
                  :head
                  ,(concat "#+TITLE: ${title}\n"
                           "#+ROAM_KEY: ${ref}\n"
                           "* Notes\n"
                           ":PROPERTIES:\n"
                           ":Custom_ID: ${citekey}\n"
                           ":URL: ${url}\n"
                           ":AUTHOR: ${author-or-editor}\n"
                           ":NOTER_DOCUMENT: %(orb-process-file-field \"${citekey}\")\n"
                           ":END:\n\n")
                  :unnarrowed t)

                 ("w" "webpage" plain (function org-roam-capture--get-point)
                  ""
                  :file-name "annotated-bibliography/${citekey}"
                  :head
                  ,(concat "#+TITLE: ${title}\n"
                           "#+ROAM_KEY: ${url}\n\n"
                           "* Notes\n"
                           ":PROPERTIES:\n"
                           ":Custom_ID: ${citekey}\n"
                           ":URL: ${url}\n"
                           ":END:\n\n")
                  :unnarrowed t))))
#+end_src

*** Variables & Constants

#+begin_src emacs-lisp
(defconst medivhok:slip-boxes-directory
  (file-name-as-directory
   (expand-file-name "slip-boxes" medivhok:app-directory))
  "The directory containing my slip boxes.")

(defconst medivhok:notes-directory
  (file-name-as-directory
   (expand-file-name "notes" medivhok:slip-boxes-directory))
  "The slip box with my notes cards.")

(defconst medivhok:annotated-bibliography-directory
  (file-name-as-directory
   (expand-file-name "annotated-bibliography" medivhok:slip-boxes-directory))
  "The slip box with my annotated bibliography cards.")

(defconst medivhok:glossaries-directory
  (file-name-as-directory
   (expand-file-name "glossaries" medivhok:slip-boxes-directory))
  "The slip box with my glossaries cards.")

(defconst medivhok:card-templates-directory
  (file-name-as-directory
   (expand-file-name "templates" medivhok:slip-boxes-directory))
  "The directory containing the card templates for my slip boxes.")

(defconst medivhok:pdf-root-directory
  (file-name-as-directory
   (expand-file-name "readings" medivhok:app-directory))
  "The root directory of my PDF files.")

(defconst medivhok:bibtex-file
  (expand-file-name "zotero.bib" medivhok:pdf-root-directory)
  "My bibtex file, generated by 'zotero'.")
#+end_src

*** Application Functions

#+begin_src emacs-lisp
(defun medivhok/card-entry-< (entry-a entry-b)
  "Returns ENTRY-A < ENTRY-B."
  (string< (car entry-a) (car entry-b)))

(defun medivhok/note-card-entry-p (card-entry)
  "Check if CARD-ENTRY is a note card."
  (string-match medivhok:notes-directory
                (plist-get (cdr card-entry) :path)))

(defun medivhok/find-note-card ()
  (interactive)
  (org-roam-find-file
   ""
   nil
   (lambda (cards-entries)
     (interactive)
     (sort (seq-filter 'medivhok/note-card-entry-p
                       cards-entries)
           'medivhok/card-entry-<))))

(defun medivhok/annotated-bibliography-card-entry-p (card-entry)
  "Check if CARD-ENTRY is an annotated bibliography card."
  (string-match medivhok:annotated-bibliography-directory
                (plist-get (cdr card-entry) :path)))

(defun medivhok/find-annotated-bibliography-card ()
  (interactive)
  (org-roam-find-file
   ""
   nil
   (lambda (cards-entries)
     (interactive)
     (sort (seq-filter 'medivhok/annotated-bibliography-card-entry-p
                       cards-entries)
           'medivhok/card-entry-<))))

(defun medivhok/glossary-card-entry-p (card-entry)
  "Check if CARD-ENTRY is a glossary card."
  (string-match medivhok:glossaries-directory
                (plist-get (cdr card-entry) :path)))

(defun medivhok/find-glossary-card ()
  (interactive)
  (org-roam-find-file
   ""
   nil
   (lambda (cards-entries)
     (interactive)
     (sort (seq-filter 'medivhok/glossary-card-entry-p
                       cards-entries)
           'medivhok/card-entry-<))))
#+end_src

** You Need A Budget (Budget)
*** ~ledger-mode~

#+begin_quote
Emacs Lisp files for interacting with the C++Ledger accounting system. -- [[https://github.com/ledger/ledger-mode][ledger-mode]]
#+end_quote

#+begin_src emacs-lisp
(use-package ledger-mode
  :defer t)
#+end_src

*** ~flycheck-ledger~

#+begin_quote
A flychecker for checking ledger files. -- [[https://github.com/purcell/flycheck-ledger][flycheck-ledger]]
#+end_quote

#+begin_src emacs-lisp
(use-package flycheck-ledger
  :after flycheck)
#+end_src

*** ~evil-ledger~

#+begin_quote
More Evil in ledger-mode. -- [[https://github.com/atheriel/evil-ledger][evil-ledger]]
#+end_quote

#+begin_src emacs-lisp
(use-package evil-ledger
  :hook
  (ledger-mode . evil-ledger-mode)

  :general
  (medivhok:local-mode-menu 'normal
    "s" 'evil-ledger-sort))
#+end_src

* Languages
** Elisp
*** ~cask~

#+begin_quote
Project management tool for Emacs. -- [[https://github.com/cask/cask][cask]]
#+end_quote

#+begin_src emacs-lisp
(use-package cask)
#+end_src

*** ~cask-mode~

#+begin_src emacs-lisp
(use-package cask-mode
  :defer t)
#+end_src

*** ~buttercup~

#+begin_src emacs-lisp
(use-package buttercup
  :defer t)
#+end_src

** Haskell
*** ~haskell-mode~
:PROPERTIES:
:Custom_ID: use-package--haskell-mode
:END:

#+begin_quote
#+end_quote

#+begin_src emacs-lisp
(use-package haskell-mode
#+end_src

**** Keybindings (~:general~)
:PROPERTIES:
:Custom_ID: use-package--haskell-mode--general
:END:

We start the [[https://github.com/noctuid/general.el#general-keyword][:general]] section of our [[#use-package--haskell-mode][use-package]] definition.

#+begin_src emacs-lisp
:general
#+end_src

**** Initializations (~:init~)
:PROPERTIES:
:Custom_ID: use-package--haskell-mode--init
:END:

#+begin_quote
NOTE: This code is executed BEFORE the package is loaded.
#+end_quote

We start the [[https://github.com/jwiegley/use-package#getting-started][:init]] section of our [[#use-package--haskell-mode][use-package]] definition.

#+begin_src emacs-lisp
:init
#+end_src

**** Configurations (~:config~)
:PROPERTIES:
:Custom_ID: use-package--haskell-mode--config
:END:

#+begin_quote
NOTE: This code is executed AFTER the package is loaded.
#+end_quote

We start the [[https://github.com/jwiegley/use-package#getting-started][:config]] section of the [[#use-package--haskell-mode][use-package]].

#+begin_src emacs-lisp
:config
#+end_src

**** Closing Paren

#+begin_src emacs-lisp
)
#+end_src
*** ~dante~
:PROPERTIES:
:Custom_ID: use-package--dante
:END:

#+begin_quote
#+end_quote

#+begin_src emacs-lisp
(use-package dante
#+end_src

