docs/Emacs.org
**** Keybindings (~:general~)
:PROPERTIES:
:Custom_ID: use-package--dante--general
:END:

We start the [[https://github.com/noctuid/general.el#general-keyword][:general]] section of our [[#use-package--dante][use-package]] definition.

#+begin_src emacs-lisp
:general
#+end_src

**** Initializations (~:init~)
:PROPERTIES:
:Custom_ID: use-package--dante--init
:END:

#+begin_quote
NOTE: This code is executed BEFORE the package is loaded.
#+end_quote

We start the [[https://github.com/jwiegley/use-package#getting-started][:init]] section of our [[#use-package--dante][use-package]] definition.

#+begin_src emacs-lisp
:init
#+end_src

**** Configurations (~:config~)
:PROPERTIES:
:Custom_ID: use-package--dante--config
:END:

#+begin_quote
NOTE: This code is executed AFTER the package is loaded.
#+end_quote

We start the [[https://github.com/jwiegley/use-package#getting-started][:config]] section of the [[#use-package--dante][use-package]].

#+begin_src emacs-lisp
:config
#+end_src

**** Closing Paren

#+begin_src emacs-lisp
)
#+end_src

*** ~attrap~
:PROPERTIES:
:Custom_ID: use-package--attrap
:END:

#+begin_quote
#+end_quote

#+begin_src emacs-lisp
(use-package attrap
#+end_src

**** Keybindings (~:general~)
:PROPERTIES:
:Custom_ID: use-package--attrap--general
:END:

We start the [[https://github.com/noctuid/general.el#general-keyword][:general]] section of our [[#use-package--attrap][use-package]] definition.

#+begin_src emacs-lisp
:general
#+end_src

**** Initializations (~:init~)
:PROPERTIES:
:Custom_ID: use-package--attrap--init
:END:

#+begin_quote
NOTE: This code is executed BEFORE the package is loaded.
#+end_quote

We start the [[https://github.com/jwiegley/use-package#getting-started][:init]] section of our [[#use-package--attrap][use-package]] definition.

#+begin_src emacs-lisp
:init
#+end_src

**** Configurations (~:config~)
:PROPERTIES:
:Custom_ID: use-package--attrap--config
:END:

#+begin_quote
NOTE: This code is executed AFTER the package is loaded.
#+end_quote

We start the [[https://github.com/jwiegley/use-package#getting-started][:config]] section of the [[#use-package--attrap][use-package]].

#+begin_src emacs-lisp
:config
#+end_src

**** Closing Paren

#+begin_src emacs-lisp
)
#+end_src
** Json (~json-mode~)

#+begin_quote
Major mode for editing JSON files with emacs.
#+end_quote

[[https://github.com/joshwnj/json-mode][json-mode]]

#+begin_src emacs-lisp
(use-package json-mode
  :custom
  (json-reformat:indent-width 2)

  :general
  (medivhok/local-leader-def 'normal
    json-mode-map
    nil '(:ignore t :which-key "json")
    "d" 'json-decrement-number-at-point
    "f" 'json-mode-beautify
    "i" 'json-increment-number-at-point
    "k" 'json-nullify-sexp
    "p" 'json-mode-show-path
    "P" 'json-mode-kill-path
    "t" 'json-toggle-boolean))
#+end_src

** LaTeX
** YAML

#+begin_src emacs-lisp
(use-package yaml-mode
  :mode "\\.ya?ml\\'")
#+end_src

** XML (~nxml~)
#+begin_src emacs-lisp
(use-package nxml-mode
  :straight nxml

  :hook
  (nxml-mode . hs-minor-mode)

  :general
  (normal nxml-mode-map "TAB" 'hs-toggle-hiding)
  (medivhok/local-leader-def 'normal
    nxml-mode-map
    nil '(:ignore t :which-key "xml")
    "t" 'hs-toggle-hiding)

  :config
  (add-to-list 'hs-special-modes-alist
               '(nxml-mode
                "<!--\\|<[^/>]*[^/]>"
                "-->\\|</[^/>]*[^/]>"
                "<!--"
                nxml-forward-element
                nil)))
#+end_src

* Appendix
** Some Snippets

Here's some snippets (see [[#use-package--yasnippet][yasnippet]]) to help in writting the
configuration file with consistency.

First, a snippet of a package installation, configuration and loading,
using ~use-package~. The ~use-package~ declaration should be under a third
level header of the name of the package, with the sections definition
(e.g. ~:init~, ~:hook~) under fourth level headers, with the last header
being the closing paren.

#+begin_src emacs-lisp :tangle ../.config/emacs/snippets/org-mode/emacscfg-usepkg.yasnippet
# -*- mode: snippet -*-
# contributor : Jean Gregory Verret <gregory.verret@gmail.com>
# key : emacscfg-usepkg
# name : [emacs config] use-package definition
# --
,*** ~$1~
:PROPERTIES:
:Custom_ID: use-package--$1
:END:

,#+begin_quote
,#+end_quote

,#+begin_src emacs-lisp
(use-package $1
,#+end_src

,**** Closing Paren

,#+begin_src emacs-lisp
  )
,#+end_src
#+end_src

The ~:preface~ section snippet.

#+begin_src emacs-lisp :tangle ../.config/emacs/snippets/org-mode/emacscfg-usepkg-preface.yasnippet
# -*- mode: snippet -*-
# contributor : Jean Gregory Verret <gregory.verret@gmail.com>
# key : emacscfg-usepkg-preface
# name : [emacs config] use-package ':preface' section
# --
,**** Preface (~:preface~)
:PROPERTIES:
:Custom_ID: use-package--$1--preface
:END:

,#+begin_quote
NOTE: This code is executed right away.
,#+end_quote

We start the [[https://github.com/jwiegley/use-package#add-preface-occurring-before-everything-except-disabled][:preface]] section of the [[#use-package--$1][use-package]].

,#+begin_src emacs-lisp
:preface
,#+end_src
#+end_src

The ~:straight~ section snippet. This section is provided by the installation of the [[#packages-installation--straight][straight]] package.

#+begin_src emacs-lisp :tangle ../.config/emacs/snippets/org-mode/emacscfg-usepkg-straight.yasnippet
# -*- mode: snippet -*-
# contributor : Jean Gregory Verret <gregory.verret@gmail.com>
# key : emacscfg-usepkg-straight
# name : [emacs config] use-package ':straight' section
# --
,**** Get Package From... (~:straight~)
:PROPERTIES:
:Custom_ID: use-package--$1--straight
:END:

We start the [[https://github.com/raxod502/straight.el#integration-with-use-package][:straight]] section of the [[#use-package--$1][use-package]].

,#+begin_src emacs-lisp
:straight
,#+end_src
#+end_src

The ~:after~ section snippet.

#+begin_src emacs-lisp :tangle ../.config/emacs/snippets/org-mode/emacscfg-usepkg-after.yasnippet
# -*- mode: snippet -*-
# contributor : Jean Gregory Verret <gregory.verret@gmail.com>
# key : emacscfg-usepkg-after
# name : [emacs config] use-package ':after' section
# --
,**** Load Package After... (~:after~)
:PROPERTIES:
:Custom_ID: use-package--$1--after
:END:

We start the [[https://github.com/jwiegley/use-package#loading-packages-in-sequence][:after]] section of the [[#use-package--$1][use-package]].

,#+begin_src emacs-lisp
:after
,#+end_src
#+end_src

The ~:hook~ section snippet.

#+begin_src emacs-lisp :tangle ../.config/emacs/snippets/org-mode/emacscfg-usepkg-hook.yasnippet
# -*- mode: snippet -*-
# contributor : Jean Gregory Verret <gregory.verret@gmail.com>
# key : emacscfg-usepkg-hook
# name : [emacs config] use-package ':hook' section
# --
,**** Hooks (~:hook~)
:PROPERTIES:
:Custom_ID: use-package--$1--hook
:END:

We start the [[https://github.com/jwiegley/use-package#hooks][:hook]] section of our [[#use-package--$1][use-package]] definition.

,#+begin_src emacs-lisp
:hook
,#+end_src
#+end_src

The ~:commands~ section snippet.

[[.config/emacs/snippets/org-mode/emacscfg-usepkg-commands.yasnippet][.config/emacs/snippets/org-mode/emacscfg-usepkg-commands.yasnippet]]
#+begin_src emacs-lisp :tangle ../.config/emacs/snippets/org-mode/emacscfg-usepkg-commands.yasnippet
# -*- mode: snippet -*-
# contributor : Jean Gregory Verret <gregory.verret@gmail.com>
# key : emacscfg-usepkg-commands
# name : [emacs config] use-package ':commands' section
# --
,**** Commands This Package Provides (~:commands~)
:PROPERTIES:
:Custom_ID: use-package--$1--commands
:END:

We start the [[https://github.com/jwiegley/use-package#key-binding][:commands]] section of our [[#use-package--$1][use-package]] definition.

,#+begin_src emacs-lisp
:commands
,#+end_src
#+end_src

The ~:custom~ section snippet.

#+begin_src emacs-lisp :tangle ../.config/emacs/snippets/org-mode/emacscfg-usepkg-custom.yasnippet
# -*- mode: snippet -*-
# contributor : Jean Gregory Verret <gregory.verret@gmail.com>
# key : emacscfg-usepkg-custom
# name : [emacs config] use-package ':custom' section
# --
,**** Custom Variables (~:custom~)
:PROPERTIES:
:Custom_ID: use-package--$1--custom
:END:

We start the [[https://github.com/jwiegley/use-package#customizing-variables][:custom]] section of our [[#use-package--$1][use-package]] definition.

,#+begin_src emacs-lisp
:custom
,#+end_src
#+end_src

The ~:custom-face~ section snippet.

#+begin_src emacs-lisp :tangle ../.config/emacs/snippets/org-mode/emacscfg-usepkg-custom-face.yasnippet
# -*- mode: snippet -*-
# contributor : Jean Gregory Verret <gregory.verret@gmail.com>
# key : emacscfg-usepkg-custom-face
# name : [emacs config] use-package ':custom-face' section
# --
,**** Custom Faces (~:custom-face~)
:PROPERTIES:
:Custom_ID: use-package--$1--custom-face
:END:

We start the [[https://github.com/jwiegley/use-package#customizing-faces][:custom-face]] section of our [[#use-package--$1][use-package]] definition.

,#+begin_src emacs-lisp
:custom-face
,#+end_src
#+end_src

The ~:general~ section snippet. This section is provided by the installation of the [[#use-package--general][general.el]] package.

#+begin_src emacs-lisp :tangle ../.config/emacs/snippets/org-mode/emacscfg-usepkg-general.yasnippet
# -*- mode: snippet -*-
# contributor : Jean Gregory Verret <gregory.verret@gmail.com>
# key : emacscfg-usepkg-general
# name : [emacs config] use-package ':general' section
# --
,**** Keybindings (~:general~)
:PROPERTIES:
:Custom_ID: use-package--$1--general
:END:

We start the [[https://github.com/noctuid/general.el#general-keyword][:general]] section of our [[#use-package--$1][use-package]] definition.

,#+begin_src emacs-lisp
:general
,#+end_src
#+end_src

The ~:init~ section snippet.

[[.config/emacs/snippets/org-mode/emacscfg-usepkg-init.yasnippet][.config/emacs/snippets/org-mode/emacscfg-usepkg-init.yasnippet]]
#+begin_src emacs-lisp :tangle ../.config/emacs/snippets/org-mode/emacscfg-usepkg-init.yasnippet
# -*- mode: snippet -*-
# contributor : Jean Gregory Verret <gregory.verret@gmail.com>
# key : emacscfg-usepkg-init
# name : [emacs config] use-package ':init' section
# --
,**** Initializations (~:init~)
:PROPERTIES:
:Custom_ID: use-package--$1--init
:END:

,#+begin_quote
NOTE: This code is executed BEFORE the package is loaded.
,#+end_quote

We start the [[https://github.com/jwiegley/use-package#getting-started][:init]] section of our [[#use-package--$1][use-package]] definition.

,#+begin_src emacs-lisp
:init
,#+end_src
#+end_src

The ~:config~ section snippet.

[[.config/emacs/snippets/org-mode/emacscfg-usepkg-config.yasnippet][.config/emacs/snippets/org-mode/emacscfg-usepkg-config.yasnippet]]
#+begin_src emacs-lisp :tangle ../.config/emacs/snippets/org-mode/emacscfg-usepkg-config.yasnippet
# -*- mode: snippet -*-
# contributor : Jean Gregory Verret <gregory.verret@gmail.com>
# key : emacscfg-usepkg-config
# name : [emacs config] use-package ':config' section
# --
,**** Configurations (~:config~)
:PROPERTIES:
:Custom_ID: use-package--$1--config
:END:

,#+begin_quote
NOTE: This code is executed AFTER the package is loaded.
,#+end_quote

We start the [[https://github.com/jwiegley/use-package#getting-started][:config]] section of the [[#use-package--$1][use-package]].

,#+begin_src emacs-lisp
:config
,#+end_src
#+end_src

** On Save

#+begin_src emacs-lisp :tangle no
(require 'org-element)

(defun medivhok/get-package-info (headline)
  (let ((package-name (org-element-property :PACKAGE_NAME hl))
        (package-url (org-element-property :PACKAGE_URL hl)))
    (when package-name
      (if package-url
          (list package-name package-url)
        package-name))))

(defun medivhok/get-package-info-list ()
  (let ((parsed-tree (org-element-parse-buffer 'headline))
        (package-info-list))
    (org-element-map parsed-tree 'headline
      (lambda (hl)
        (let ((package-info (medivhok/get-package-info hl)))
          (when package-info
            (push package-info package-info-list)))))))

(message "List : %s" (medivhok/get-package-info-list))
#+end_src

#+RESULTS:
: List : (((org-mode https://orgmode.org)) ((org-roam https://orgroam.com) (org-mode https://orgmode.org)))
