.config/emacs/init.el
;; :Custom_ID: use-package--dante--general
;; :END:

;; We start the [[https://github.com/noctuid/general.el#general-keyword][:general]] section of our [[#use-package--dante][use-package]] definition.


:general

;; Initializations (~:init~)
;; :PROPERTIES:
;; :Custom_ID: use-package--dante--init
;; :END:

;; #+begin_quote
;; NOTE: This code is executed BEFORE the package is loaded.
;; #+end_quote

;; We start the [[https://github.com/jwiegley/use-package#getting-started][:init]] section of our [[#use-package--dante][use-package]] definition.


:init

;; Configurations (~:config~)
;; :PROPERTIES:
;; :Custom_ID: use-package--dante--config
;; :END:

;; #+begin_quote
;; NOTE: This code is executed AFTER the package is loaded.
;; #+end_quote

;; We start the [[https://github.com/jwiegley/use-package#getting-started][:config]] section of the [[#use-package--dante][use-package]].


:config

;; Closing Paren


)

;; ~attrap~
;; :PROPERTIES:
;; :Custom_ID: use-package--attrap
;; :END:

;; #+begin_quote
;; #+end_quote


(use-package attrap

;; Keybindings (~:general~)
;; :PROPERTIES:
;; :Custom_ID: use-package--attrap--general
;; :END:

;; We start the [[https://github.com/noctuid/general.el#general-keyword][:general]] section of our [[#use-package--attrap][use-package]] definition.


:general

;; Initializations (~:init~)
;; :PROPERTIES:
;; :Custom_ID: use-package--attrap--init
;; :END:

;; #+begin_quote
;; NOTE: This code is executed BEFORE the package is loaded.
;; #+end_quote

;; We start the [[https://github.com/jwiegley/use-package#getting-started][:init]] section of our [[#use-package--attrap][use-package]] definition.


:init

;; Configurations (~:config~)
;; :PROPERTIES:
;; :Custom_ID: use-package--attrap--config
;; :END:

;; #+begin_quote
;; NOTE: This code is executed AFTER the package is loaded.
;; #+end_quote

;; We start the [[https://github.com/jwiegley/use-package#getting-started][:config]] section of the [[#use-package--attrap][use-package]].


:config

;; Closing Paren


)

;; Json (~json-mode~)

;; #+begin_quote
;; Major mode for editing JSON files with emacs.
;; #+end_quote

;; [[https://github.com/joshwnj/json-mode][json-mode]]


(use-package json-mode
  :custom
  (json-reformat:indent-width 2)

  :general
  (medivhok/local-leader-def 'normal
    json-mode-map
    nil '(:ignore t :which-key "json")
    "d" 'json-decrement-number-at-point
    "f" 'json-mode-beautify
    "i" 'json-increment-number-at-point
    "k" 'json-nullify-sexp
    "p" 'json-mode-show-path
    "P" 'json-mode-kill-path
    "t" 'json-toggle-boolean))

;; YAML


(use-package yaml-mode
  :mode "\\.ya?ml\\'")

;; XML (~nxml~)

(use-package nxml-mode
  :straight nxml

  :hook
  (nxml-mode . hs-minor-mode)

  :general
  (normal nxml-mode-map "TAB" 'hs-toggle-hiding)
  (medivhok/local-leader-def 'normal
    nxml-mode-map
    nil '(:ignore t :which-key "xml")
    "t" 'hs-toggle-hiding)

  :config
  (add-to-list 'hs-special-modes-alist
               '(nxml-mode
                "<!--\\|<[^/>]*[^/]>"
                "-->\\|</[^/>]*[^/]>"
                "<!--"
                nxml-forward-element
                nil)))
